# Pandas Tutorial
***
> Content Creator : MATHEWS JOB

## What are pandas?
***
1. Pandas in Python is a package that is written for data analysis and manipulation. <br>
2. Pandas offer various operations and data structures to perform numerical data manipulations and time series.<br>

3. Pandas is an open-source library that is built over Numpy libraries.<br>

4. Pandas library is known for its high productivity and high performance.<br>

5. Pandas is popular because it makes importing and analyzing data much easier.<br>

### HOW TO INSTALL PANDAS

__Install Pandas using pip__
****

PIP is a package management system used to install and manage software packages/libraries written in Python. These files are stored in a large “on-line repository” termed as Python Package Index (PyPI).
> Pandas can be installed using PIP by the use of the following command:
>> __pip install pandas__

1. Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

2. Pandas DataFrame consists of three principal components, the data, rows, and columns.
3. Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file
4. Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc.

## Creating a Dataframe using List

In [20]:
# import pandas as pd
import pandas as pd
 
# list of strings
lst = ['Hello','Mathews','welcome','to','pandas']
 
# Calling DataFrame constructor on list

df = pd.DataFrame(lst)
df

         0
0    Hello
1  Mathews
2  welcome
3       to
4   pandas

## Creating a Dict of Ndarray/List

In [21]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Math', 'Job', 'Ann', 'Dona'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
df

   Name  Age
0  Math   20
1   Job   21
2   Ann   19
3  Dona   18

## Dealing the rows and cloumns

In [34]:
import pandas as pd

data = {'Name': ['Mathews','Pauls','Don','Victor'],'Age':[20,22,24,26],'Qualification':['MS','MBA','BBA','BTECH']}
data

{'Name': ['Mathews', 'Pauls', 'Don', 'Victor'],
 'Age': [20, 22, 24, 26],
 'Qualification': ['MS', 'MBA', 'BBA', 'BTECH']}

__Column selection__ : In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name

In [35]:
new_df=pd.DataFrame(data)
new_df

      Name  Age Qualification
0  Mathews   20            MS
1    Pauls   22           MBA
2      Don   24           BBA
3   Victor   26         BTECH

In [38]:
new_df['Name']

0    Mathews
1      Pauls
2        Don
3     Victor
Name: Name, dtype: object

In [40]:
new_df[['Name','Qualification']]

      Name Qualification
0  Mathews            MS
1    Pauls           MBA
2      Don           BBA
3   Victor         BTECH

__Row Selection__ : Row access using index can be performed in several ways:

   1. using .loc and providing index label
   2. using .iloc and providing index number

> __Read a excel file to DataFrame__

In [46]:
t_data =pd.read_csv('train.csv')

In [86]:
t_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

> __Acessing the index label__

> .loc takes 2 arguments: index list and column list

In [89]:
t_data.loc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

In [94]:
t_data.loc[2]['Name']

'Heikkinen, Miss. Laina'

In [97]:
t_data.loc[0:4][['Name','Sex']]

                                                Name     Sex
0                            Braund, Mr. Owen Harris    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male

> __Accessing the index number__

In [92]:
t_data.iloc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

In [95]:
t_data.iloc[2]['Name']

'Heikkinen, Miss. Laina'

In [109]:
t_data.loc[:5][:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q